Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/personal_insolvency/what_is_bankruptcy.html.txt.tmx
Source language: en
Languages: ga

source: Bankruptcy is a settlement of the debts of someone who is wholly or partially unable to repay their debts
ga: Is éard is féimheacht ann ná glanadh fiachas duine atá go hiomlán nó go páirteach neamhábalta a chuid fiachas a aisíoc

source: It deals with both secured and unsecured debt
ga: Déileálann sí le fiachas urraithe agus neamhurraithe araon

source: The purpose of the bankruptcy is to distribute your assets fairly among your creditors and protect you from these creditors
ga: Is éard is cuspóir na féimheachta ná chun do shócmhainní a dháileadh go cóir i measc do chreidiúnaithe agus thú a chosaint ó na creidiúnaithe seo

source: The distribution is done through a court official, the Official Assignee in Bankruptcy, who is based in the Insolvency Service of Ireland (ISI) and manages its Bankruptcy Division
ga: Déantar an dáileadh trí oifigeach cúirte, an Sannaí Oifigiúil i bhFéimheacht, atá bunaithe anois i Seirbhís Dócmhainneachta na hÉireann (SDÉ) agus a riarann Rannóg Féimheachta an SDÉ

source: The Bankruptcy (Amendment) Act 2015, which was signed into law on 25 December 2015, provides for several changes to the rules on bankruptcy
ga: Forálann an tAcht Féimheachta (Leasú) 2015 roinnt athruithe sna rialacha faoi fhéimheacht

source: It includes the following provisions, which came into effect on 29 January 2016:
ga: Ina measc tá na h-athruithe seo, a tháinig i bhfeidhm ar 29 Eanáir 2016:

source: • Reducing the normal duration of bankruptcy from 3 years to 1 year (up to December 2013 it was 12 years)
ga: • Gnáthfhad na féimheachta a laghdú ó 3 bliana anuas go dtí bliain amhain (roimh Nollaig 2013 ba 12 bhliain a bhí ann)

source: • Returning ownership of the bankrupt person’s home to them after 3 years (subject to any outstanding mortgage) unless it must be sold to pay creditors
ga: • Úinéireacht theach an duine fhéimhigh a thabhairt ar ais dóibh i ndiaidh 3 bliana (faoi réir aon mhorgáiste nár íocadh a íoc) mura gá an teach a dhíol chun creidiúnaithe a íoc

source: • Reducing the maximum duration of bankruptcy payment orders from 5 years to 3 years, except in cases of non-co-operation or concealment of assets
ga: • Fad uasta orduithe íocaíochta féimheachta a laghdú anuas ó 5 bliana go dtí 3 bliana, seachas i gcásanna neamh-chomhoibrithe nó ceilte sócmhainní

source: • Extending the duration of bankruptcy in cases of non-co-operation or concealment
ga: • Fad na féimheachta a shíneadh i gcásanna neamh-chomhoibrithe nó ceilte

source: • Streamlining and clarifying the processes
ga: • Na próisis a chuíchóiriú agus a shoiléiriú

source: Read more about the changes on isi.gov.ie (pdf)
ga: Faigh tuilleadh eolais ar isi.gov.ie (pdf)

source: If you are in serious financial difficulties, you may decide that declaring bankruptcy is the best solution for you
ga: Má tá deacrachtaí tromchúiseacha airgeadais agat, féadfaidh tú an cinneadh a dhéanamh gurb é d’fhéimheacht a dhearbhú an réiteach is fearr duit

source: The ISI has published detailed information on bankruptcy, a debtor’s guide (pdf) and a set of scenarios (pdf)
ga: D’fhoilsigh SDÉ faisnéis mhionsonraithe ar fhéimheacht, treoir d’fhéichiúnaithe (pdf) agus sraith cásanna (pdf)

source: Its backontrack.ie website also has user-friendly information and guides on bankruptcy
ga: Tá tuilleadh eolais le fáil ar backontrack.ie

source: The Money Advice and Budgeting Service (MABS) recommends that anyone thinking of applying for bankruptcy should seek legal advice
ga: Molann an tSeirbhís Bhuiséadta agus Chomhairle Airgid (SBCA) gur cheart do dhuine ar bith atá ag machnamh ar iarratas a dhéanamh ar fhéimheacht comhairle dlí a lorg

source: The ISI also recommends anyone who is in doubt in relation to their legal or financial position to take appropriate professional advice
ga: Molann SDÉ, chomh maith, gur cheart d’aon duine a bhfuil amhras orthu maidir lena suíomh dlíthiúil nó airgeadais an chomhairle chuí ghairmiúil a fháil

source: A creditor can petition for bankruptcy against you if you have committed an act of bankruptcy within the previous 3 months
ga: Féadfaidh creidiúnaí achainí a dhéanamh i leith féimheachta i do leith má rinne tú gníomh féimheachta le 3 mhí anuas

source: This is known as a creditor’s petition
ga: Tugtar achainí creidiúnaí air seo

source: Examples of acts of bankruptcy are:
ga: Samplaí de ghníomhartha féimheachta iad:

source: • If you fail to comply with a bankruptcy summons requesting payment of a specific sum due, within 14 days from service of the summons on you
ga: • Má theipeann ort toghairm féimheachta a chomhlíonadh a d'iarr ar shuim shonrach a íoc, laistigh de 14 lá tar éis an toghairm a sheirbheáil ort

source: • If the sheriff or county registrar makes a return of 'no goods' in respect of you - this is the return made by a sheriff to an order authorising him to seize the goods of a person when he has been unable to find any goods to seize
ga: • Má dhéanann an sirriam nó an cláraitheoir contae tuairisceán ‘earraí ar bith’ i do leith – seo an tuairisceán a dhéanann sirriam i leith ordú a thugann an t-údarú dó/di chun earraí duine a urghabháil nuair nach raibh sé/sí in ann teacht ar aon earraí le hurghabháil

source: The Personal Insolvency Act 2012 introduced two additional acts of bankruptcy:
ga: Thug an tAcht um Dhócmhainneacht Phearsanta, 2012 dhá ghníomh bhreise féimheachta isteach:

source: • Where the debtor has been subject to a Debt Settlement Arrangement which has been terminated or which is deemed to have failed
ga: • Sa chás go raibh an féichiúnaí faoi réir Socrú Glanta Fiachais ar cuireadh deireadh leis nó a meastar ar theip air

source: • Where the debtor has been subject to a Personal Insolvency Arrangement which has been terminated or which has failed
ga: • Sa chás go raibh an féichiúnaí faoi réir Socrú Dócmhainneachta Pearsanta ar cuireadh deireadh leis nó a meastar ar theip air

source: The ISI has published information for creditors
ga: D’fhoilsigh SDÉ faisnéis le haghaidh creidiúnaithe

source: What alternatives are there?
ga: Cén roghanna eile atá ann?

source: You may be eligible for one of the 3 debt resolution processes introduced under the Personal Insolvency Act 2012 – read more in our document on personal insolvency options
ga: D’fhéadfá a bheith incháilithe do cheann amháin de na 3 phróiseas glanta fiachais a tugadh isteach faoin Acht um Dhócmhainneacht Phearsanta 2012 – is féidir leat níos mó a léamh faoi inár gcáipéis ar roghanna dócmhainneachta pearsanta

source: Bankruptcy process and outcomes
ga: An próiseas iarratais agus torthaí na féimheachta

source: There are several steps you must take when you have decided (alone or with professional advice) to make yourself bankrupt
ga: Tá roinnt céimeanna nach mór duit tabhairt fúthu nuair a rinne tú an cinneadh (cibé acu tar éis an cinneadh a dhéanamh tú féin nó tar éis comhairle ghairmiúil a fháil) tú féin a dhéanamh féimheach

source: While instructing a solicitor is not necessary, the ISI considers it advisable to get professional legal advice in advance of declaring yourself bankrupt or defending any bankruptcy proceedings
ga: Cé nach gá aturnae a threorú, measann SDÉ gur ceart comhairle ghairmiúil dlí a fháil sula ndearbhaíonn tú féin féimheach nó aon imeachtaí féimheachta a chosaint

source: The Irish Mortgage Holders Organisation (IMHO) provides a free service (excluding Official Assignee and court administration costs) in relation to bankruptcy
ga: Soláthraíonn Eagraíocht Sealbhóirí Mórgáiste na hÉireann (ESMÉ) seirbhís saor in aisce (gan costais Sannaí Oifigiúil agus riaracháin cúirte a áireamh) maidir le féimheacht

source: The ISI’s website has the forms that you need to apply for bankruptcy, along with detailed notes on the application process (pdf)
ga: Tá ar láithreán gréasáin SDÉ na foirmeacha a theastaíonn uait chun iarratas a dhéanamh ar fhéimheacht, mar aon le treoir mhionsonraithe maidir leis an bpróiseas iarratais (pdf)

source: The process is summarised below:
ga: Tugtar achoimre ar an bpróiseas thíos:

source: • Lodge €200 with the Official Assignee
ga: • €200 a chur i dtaisce leis an Sannaí Oifigiúil

source: • Complete your petition, which must be verified by a sworn affidavit and a sworn statement of affairs
ga: • D’achainí a chomhlánú, nach mór a bheith dearbhaithe ag mionnscríbhinn faoi mhionn agus ráiteas gnóthaí faoi mhionn

source: • Get the above documents stamped at a court Stamp Office
ga: • Na cáipéisí thuas a bheith stampáilte ag Oifig Stampa cúirte

source: • File the stamped documents and statement of affairs at the Examiner’s Office and get a court date
ga: • Na cáipéisí stampáilte agus an ráiteas stampáilte gnóthaí a bheith comhdaithe ag Oifig an Scrúdaitheora – féach ‘Cá ndéanfaidh mé iarratas? ’ – agus dáta cúirte a fháil

source: • Attend the court hearing on that date, where the judge, if satisfied, will adjudicate you bankrupt
ga: • Freastal ar éisteacht na cúirte ar an dáta sin, áit a ndéanfaidh an breitheamh, sa chás go bhfuil sé/sí sásta, a b(h)reithniú go bhfuil tú féimheach

source: • Meet the Official Assignee or Bankruptcy Inspector to be interviewed about all your assets and debts
ga: • Casadh leis an Sannaí Oifigiúil nó leis an gCigire Féimheachta go gcuirfear agallamh ort faoi do shócmhainní agus fiachais go léir

source: • Place a notice of your adjudication as a bankrupt in Iris Oifigiúil (the State gazette)
ga: • Fógra faoi dháta do shuite reachtúla* san Ard-Chúirt a chur in Iris Oifigiúil (iris an Stáit) agus i nuachtán náisiúnta laethúil nó ar láithreán gréasáin SDÉ

source: • Place a notice of your adjudication as a bankrupt either on the ISI’s website or in a national daily newspaper
ga: • Freastal a dhéanamh ar shuí na hArd-Chúirte chun fógra a thabhairt do do chreidiúnaithe i leith d’fhéimheachta

source: Before 1 June 2016 a statutory High Court sitting was also required, but this requirement was removed by the Bankruptcy (Amendment) Act 2015
ga: *Forálann an tAcht Féimheachta (Leasú) 2015 deireadh a chur leis an suí reachtúil san Ard-Chúirt

source: What happens when you are declared bankrupt?
ga: Níl an t-athrú seo i bhfeidhm go fóill

source: A Bankruptcy Inspector from the ISI will serve you with a copy of the Order of Adjudication (Bankruptcy Order) and Warrant of Seizure
ga: Céard a tharlaíonn nuair a dhearbhaítear go bhfuil tú féimheach?

source: Your bank accounts will be frozen, except for one current account in which you can keep a balance of up to €1,000 for general living expenses
ga: Seirbheálfaidh Cigire Féimheachta ón SDÉ cóip den Ordú Breithiúnais (Ordú Féimheachta) agus Barántas Urghabhála duit

source: As soon as your bankruptcy starts, you are free of debt
ga: A luaithe a thosaíonn d’fhéimheacht, beidh tú saor ó fhiachas

source: The Official Assignee now owns your assets and administers your estate
ga: Is leis an Sannaí Oifigiúil anois do shócmhainní agus riarann sé d’eastát

source: Your creditors can no longer seek repayment directly from you
ga: Ní féidir le do chreidiúnaithe aisíocaíocht a lorg a thuilleadh go díreach uait

source: They must deal directly with the Official Assignee and all correspondence should be forwarded to him
ga: Ní mór dóibh déileáil go díreach leis an Sannaí Oifigiúil agus ba cheart gach comhfhreagras a chur faoina bhráid

source: You must contribute any surplus income to the Official Assignee
ga: Ní mór duit aon ioncam breise a ranníoc leis an Sannaí Oifigiúil

source: Your name will appear in the Bankruptcy Register, which is kept in the Office of the Examiner of the High Court
ga: Beidh d’ainm le sonrú sa Chlár Féimheachta, a choimeádtar in Oifig Scrúdaitheoir na hArd-Chúirte

source: Anyone can check this register
ga: Féadfaidh duine ar bith an clár seo a sheiceáil

source: Read more in the ISI’s guide After you are made bankrupt (pdf)
ga: Léigh tuilleadh i dtreoir an SDÉ (pdf)

source: The Official Assignee will negotiate an Income Payment Agreement or seek an Income Payment Order for the surplus of your income over the reasonable living expenses for your situation, based on the ISI’s guidelines
ga: Déanfaidh an Sannaí Oifigiúil idirbheartaíocht ar Chomhaontú Íocaíochta Ioncaim nó lorgóidh sé Ordú Íocaíochta do bharrachas d’ioncaim os cionn na gcostas réasúnta maireachtála a bheidh i gceist i dtaobh do cháis, bunaithe ar threoirlínte SDÉ

source: The agreement or order will last up to 3 years
ga: Mairfidh an comhaontú nó an t-ordú a fhad le 3 bliana

source: (The Bankruptcy (Amendment) Act 2015 reduced this period from 5 years, with effect from 29 January 2016.) No deductions will be made from social welfare payments
ga: (Laghdaigh an tAcht Féimheachta (Leasú) 2015 an tréimhse seo ó 5 bliana, ó 29 Eanáir 2016 amach.) Ní dhéanfar aon asbhaintí ó íocaíochtaí leasa shóisialaigh

source: Read more about how bankruptcy affects your income
ga: Is féidir leat tuilleadh a léamh faoi conas a imríonn féimheacht tionchar ar d’ioncam

source: All of your assets, with the exception of necessities up to a value of €6,000, are transferred to the Official Assignee, who will sell them
ga: Aistrítear go huathoibríoch do shócmhainní uile go léir, seachas sócmhainní riachtanacha a mhéid le luach €6,000 (mura gceadaíonn an Ard-Chúirt níos mó) chuig an Sannaí Oifigiúil, a dhíolfaidh iad

source: You are entitled to retain the following as 'excluded items' from bankruptcy to a value of €6,000, although you may apply to the court to increase that figure:
ga: Tá tú i dteideal an méid a leanas a choimeád mar ‘earraí eisiata’ ó fhéimheacht a mhéid le luach €6,000, cé go bhféadfá iarratas a dhéanamh ar an gcúirt chun an figiúr sin a mhéadú:

source: • Furniture and tools or equipment relating to trade
ga: • Troscán agus uirlisí nó trealamh a bhaineann le trádáil

source: • Necessities for your family and any dependent relatives living with you
ga: • Rudaí atá riachtanacha do do theaghlach agus aon gaoil chleithiúnacha a chónaíonn leat

source: Once your assets are sold, the Official Assignee will pay costs, expenses, fees and certain priority debts, such as taxes, and distribute the remainder among your creditors
ga: A luaithe a dhíoltar do shócmhainní, íocfaidh an Sannaí Oifigiúil costais, speansais, táillí agus roinnt fiachais tosaíochta, ar nós cánacha, agus leithdháilfidh sé/sí an fuílleach i measc do chreidiúnaithe

source: If you acquire assets after the date when you are made bankrupt (for example, through inheritance) the Official Assignee can claim them and sell them for the benefit of your creditors
ga: Má fhaigheann tú sócmhainní i ndiaidh an dáta a dhéantar féimheach thú (mar shampla, trí oidhreacht) féadfaidh an Sannaí Oifigiúil iad a éileamh agus iad a dhíol ar mhaithe le do chuid creidiúnaithe

source: If you own a family home, by yourself or with another person, the Official Assignee may only sell it with the prior permission of the court
ga: Má tá teach teaghlaigh agat, leat féin nó le duine eile, ní fhéadfaidh an Sannaí Oifigiúil é a dhíol ach tar éis cead roimh ré a fháil ón gcúirt

source: Where this permission is sought, the court will balance the interests of your creditors against the interests of your family and may decide to postpone the sale of your home
ga: Sa chás go lorgaítear an cead seo, déanfaidh an chúirt leas do chreidiúnaithe a chomhardú i leith leas do theaghlaigh agus féadfaidh siad an cinneadh a dhéanamh chun díol do thí a chur ar athló

source: If you hold property jointly (for example, with your spouse) your bankruptcy will cause the joint ownership to be split between the Official Assignee and your non-bankrupt co-owner
ga: Má tá comhúinéireacht agat ar mhaoin (mar shampla, le do chéile nó páirtnéir sibhialta), déanfar an chomhúinéireacht a roinnt idir an Sannaí Oifigiúil agus do chomhúinéir neamhfhéimheach mar gheall ar d'fhéimheacht

source: The Bankruptcy (Amendment) Act 2015 provides for ownership of your home to be re-vested in you, subject to any outstanding mortgage, 3 years after you have been adjudicated bankrupt (with some exceptions)
ga: Foráiltear san Acht Féimheachta (Leasú), 2015 d’úinéireacht do thí a athdhílsiú ionat, faoi réir go n-íocann tú as aon mhorgáiste gan íoc, 3 bliana i ndiaidh gur breithníodh go raibh tú féimheach (bíonn roinnt eisceachtaí i gceist)

source: This change came into effect on 29 January 2016
ga: Níl an t-athrú seo i bhfeidhm go fóill

source: Restrictions on people who have been declared bankrupt
ga: Srianta ar dhaoine a dearbhaíodh ina bhféimhigh

source: Once you have been declared bankrupt, you will be guilty of an offence if:
ga: A luaithe a dhearbhaítear thú i d’fhéimheach, beidh tú ciontach i gcion:

source: • You do not disclose the bankruptcy when getting a loan or any other credit facility of €650 or more
ga: • Mura nochtann tú an fhéimheacht nuair a fhaigheann tú iasacht nó aon áis chreidmheasa €650 nó níos mó

source: • When trading in a name other than that in which you were made bankrupt, you do not disclose the bankruptcy
ga: • Mura nochtann tú an fhéimheacht, nuair a bhí trádáil á déanamh agat in ainm seachas é sin ina ndearnadh féimheach thú

source: • You act as a director, manager, auditor, liquidator or receiver of a company without permission of the court
ga: • Gníomhaíonn tú mar stiúrthóir, bainisteoir, iniúchóir, leachtaitheoir nó glacadóir cuideachta gan cead na cúirte a bheith faighte agat

source: These offences carry a maximum penalty of 5 years in prison and a fine of €1,270
ga: Gearrtar pionós uasta 5 bliana sa phríosún agus fíneáil €1,270 ar na cionta seo

source: Other consequences of bankruptcy are:
ga: I measc na n-iarmhairtí eile d’fhéimheacht, tá:

source: • If you wish to travel outside the State, you should tell the Official Assignee
ga: • Más mian leat taisteal lasmuigh den Stát, ba cheart duit an Sannaí Oifigiúil a chur ar an eolas

source: You may be arrested if it seems to the High Court that you are leaving the State in order to avoid the consequences of your bankruptcy
ga: D’fhéadfaí thú a ghabháil más dealraitheach don Ard-Chúirt go bhfuil tú ag fágáil an Stáit chun iarmhairtí d’fhéimheachta a sheachaint

source: • You cannot be granted an enduring power of attorney on behalf of someone else, and if you hold one already, it is automatically revoked if you become bankrupt
ga: • Ní féidir buan chumhacht aturnae a dheonú duit thar ceann duine eile, agus má tá ceann acu cheana féin, cúlghairtear go huathoibríoch é má éiríonn tú féimheach

source: • Under the Charities Act 2009, you may not be a trustee of a charity if you are adjudicated bankrupt
ga: • Faoin Acht Carthanas, 2009 ní féidir leat bheith mar iontaobhaí de charthanas má bhreithnítear go bhfuil tú féimheach

source: • Some professional bodies disqualify members who are adjudicated bankrupt
ga: • Dícháilíonn roinnt comhlachtaí gairmiúla comhaltaí a bhreithnítear atá féimheach

source: The EU Insolvency Regulation (pdf) aims to simplify formalities governing the reciprocal recognition and enforcement of judgments in cross-border insolvency matters
ga: Tá sé mar chuspóir ag Rialachán Dócmhainneachta (pdf) an AE na gnásanna foirmiúla a rialaíonn aitheantas agus cómhalartach breithiúnas i gceisteanna dócmhainneachta trasteorann a shimpliú

source: The Regulation designates bankruptcy as an insolvency proceeding which can benefit from cross-border recognition
ga: Sannann an Rialachán féimheacht mar imeacht dócmhainneachta ar féidir léi tairbhe a bhaint ó aitheantas trasteorann

source: This means that a debtor availing of bankruptcy will gain the same protection against creditors in most other EU countries that they receive in Ireland, subject to and in accordance with the Insolvency Regulation
ga: Ciallaíonn seo go mbeidh an chosaint chéanna ag féichiúnaí a fhaigheann féimheacht i leith creidiúnaithe i dtromlach mór na dtíortha den AE a fhaigheann siad in Éirinn, faoi réir an Rialacháin Dócmhainneachta agus i gcomhréir leis

source: (The 3 processes introduced by the Personal Insolvency Act also come under this Regulation.)
ga: (Tagann na 3 phróiseas a thug an tAcht um Dhócmhainneacht Phearsanta isteach faoin Rialachán seo freisin.)

source: You are automatically discharged from bankruptcy 1 year (formerly 3 years) after the order of adjudication
ga: Díscaoiltear go huathoibríoch thú ó fhéimheacht tar éis bhliain amháin (laghdaithe ó 3 bliana) tar éis an ordaithe breithiúnais

source: Your name will remain on the register, as a discharged bankrupt
ga: Fanfaidh d’ainm ar an gclár, mar fhéimheach díscaoilte

source: If there is an Income Payment Agreement or an Income Payment Order in place, you will still have to comply with it until it expires
ga: Má tá Comhaontú Íocaíochta Ioncaim nó Ordú Íocaíochta Ioncaim i bhfeidhm, beidh ort é a chomhlíonadh go dtí go n-éagann sé

source: These arrangements can last up to 3 years (formerly 5 years)
ga: Féadfaidh na socruithe seo maireachtáil ar feadh a fhad le 3 bliana (laghdaithe ó 5 bliana)

source: You can also be discharged from bankruptcy if you meet certain conditions, as follows:
ga: Anuas air sin, féadtar thú a dhíscaoileadh ó fhéimheacht má chomhlíonann tú roinnt coinníollacha, mar seo a leanas:

source: If your assets have been sold and all your costs, fees, expenses and preferential debts (such as certain tax debts) have been paid, it is possible for you to be discharged from bankruptcy even if you have not paid all of your debts
ga: Má díoladh do shócmhainní agus má íocadh do chostais, táillí, speansais agus fiachais tosaíochta (ar nós fiachais áirithe chánach), is féidir leat a bheith díscaoilte ó fhéimheacht fiú murar íoc tú d’fhiachais go léir

source: You can be released from bankruptcy in any of the following ways:
ga: Féadtar thú a scaoileadh ó fhéimheacht ar aon cheann de na bealaí a leanas:

source: If your creditors have been paid in full
ga: Má íocadh do chreidiúnaithe ina n-iomláine

source: If all of your unsecured creditors give their consent
ga: Má thugann do chreidiúnaithe neamhurraithe a dtoiliú

source: After agreeing and paying a settlement with at least 60% of your unsecured creditors (called an Offer of Composition)
ga: Tar éis comhaontú a dhéanamh ar ghlanadh agus é a íoc le 60%, ar a laghad, de do chreidiúnaithe neamhurraithe (ar a dtugtar Tairiscint Imshocraíochta)

source: Automatically after 1 year (formerly 3 years) as noted above
ga: Go huathoibríoch i ndiaidh bhliain amháin (laghdaithe ó 3 bliana) faoi mar a shonraítear thuas

source: When you are discharged from bankruptcy on grounds 1 to 3 above, any money or property remaining in your estate is returned to you, provided all the costs, court fees, expenses and preferential debts of bankruptcy are paid
ga: Nuair a dhíscaoiltear thú ó fhéimheacht ar aon cheann de bhealaí 1 go 3 thuas, tugtar aon airgead nó maoin atá fanta ar ais duit, a fhad agus go bhfuil na costais, táillí cúirte, speansais agus fiachais tosaíochta féimheachta íoctha

source: If you are automatically discharged after the end of the normal bankruptcy term without having satisfied your creditors on grounds 1 to 3 above, after discharge all your assets continue to vest in the Official Assignee for payment of all your debts, costs, fees and expenses in bankruptcy
ga: Má dhéantar thú a dhíscaoileadh go huathoibríoch ag deireadh an ghnáth-théarma féimheachta gan do chuid creidiúnaithe a shásamh i dtaobh fhoras 1 go dtí 3 thuas, leantar le do shócmhainní go léir a dhílsiú sa Sannaí Oifigiúil i ndiaidh díscaoilte chun d’fhiachais, costais, táillí agus speansais go léir a íoc atá féimheach

source: Details of fees payable are published on the ISI’s website
ga: Tá sonraí faoi na táillí atá le híoc foilsithe ar láithreán gréasáin SDÉ
